#+TITLE: Lab 01: Hello World, Basic I/O, and Vectors

* Part 3: Vectors

~std::vector~ is essentially an array. Unlike an array in C, ~std::vector~ has no maximum size constraint. To implement a 
similar data structure in C, ~malloc~ or ~realloc~ function calls would be required to adjust the capacity of the array. 
However, ~std::vector~ internally manages its memory safely and efficiently. A ~std::vector~ should be used in favor of an array 
in nearly all cases. Further information can be found at [[https://en.cppreference.com/w/cpp/container/vector]].

The program below uses ~std::vector~ to store the sequence ~10, 6, 17, 111, 116~ then prints out the elements of the vector 
in order. The output of the program is shown below the code listing.

#+BEGIN_SRC cpp :results output :exports both
#include <iostream>
#include <vector>

int main() {
	std::vector<int> vec {};
	
	vec.push_back(10);
	vec.push_back(6);
	vec.push_back(17);
	vec.push_back(111);
	vec.push_back(116);

	std::cout << "vec contains " << vec.size() << " elements\n";
	std::cout << "Contents: ";
	for (auto val : vec) {
		std::cout << val << " ";
	}
	std::cout << std::endl;

	return 0;
}
#+END_SRC

#+RESULTS:
: vec contains 5 elements
: Contents: 10 6 17 111 116

** Vector Element Access

The program below demonstrates the ~at~ function of ~std::vector~, which is used to access specific elements of the vector by 
index. The output of the program appears below the code listing. Alternatively, you can use square brackets, ~[]~, to access 
specific elements in a ~std::vector~ like an array. However, unlike an array square brackets can not be used to insert an 
element into a ~std::vector~. Use ~at~ instead of ~[]~ to avoid confusion when working with vectors.

#+BEGIN_SRC cpp :results output :exports both
#include <iostream>
#include <vector>

int main() {
	std::vector<int> vec {};
	
	vec.push_back(10);
	vec.push_back(6);
	vec.push_back(17);
	vec.push_back(111);
	vec.push_back(116);

	std::cout << "The first element of vec is " << vec.at(0) << std::endl;
	std::cout << "The last element of vec is " << vec.at(vec.size() - 1) << std::endl;

	return 0;
}
#+END_SRC

#+RESULTS:
: The first element of vec is 10
: The last element of vec is 116

